{
    "quotes": [{
            "quote": "I've been using Only Insurance Leads for about 10 years now. To get a feel for the results, I started out at 2,000 letters a month and now I do 18,000 letters a month. The results are consistent, and Only Insurance Leads are now my one and only marketing program. You send them an email anytime day or night and they respond right away. Fantastic results and excellent service!!",
            "cite": "Tom Krause",
            "company": "Tom Krause & Associates",
            "companyClass": "associates"
        }, {
            "quote": "Shana,<br>Thank you so much for your services over the last several years. Your monthly letter was a big help to my agency.<br>Your service is unmatched. You are truly appreciated.",
            "cite": "Alan Beyerle",
            "company": "Farmers Insurance Agency",
            "companyClass": ""
        }, {
            "quote": "Best marketing program I have used in the 20+ years of being a district manager. My agents love it!",
            "cite": "Doug Dillard, District Manager",
            "company": "Farmers Insurance, California",
            "companyClass": ""
        }, {
            "quote": "I have purchased leads in the past where I'm quoting against multiple agents. Only Insurance Leads allows me to be in front of multiple clients a day and be the only agent quoting their property!",
            "cite": "David Schuman",
            "company": "David Schuman Insurance, Inc., Florida",
            "companyClass": ""
        }, {
            "quote": "I have been using Only Insurance Leads for almost 3 years now.  Sales from their direct mailers account for 34% of my entire book of business.  Needless to say, my partnership with OIL has been a huge success.",
            "cite": "Chris Hodgins",
            "company": "My Florida Insurance Broker, Florida",
            "companyClass": ""
        }, {
            "quote": "I am very pleased with the service and results I have received from using Only Insurance Leads. With all of the expensive low quality systems that I have tried over several years, this has been a consistent and effective tool for growing my agency.",
            "cite": "Markus A. Johnson",
            "company": "Allstate Insurance, Ohio",
            "companyClass": ""
        }, {
            "quote": "I’ve been using Only Insurance Leads since 2007. Hands down, it has been the most consistent, successful marketing program I have ever used.",
            "cite": "Gary Kuketz",
            "company": "Farmers Insurance Agency, Texas",
            "companyClass": ""
        }, {
            "quote": "I have been using Only Insurance Leads for almost 2 years now and it is consistently my number one source for generating new business. It is the fastest, easiest and most effective way to bring new clients into my agency.",
            "cite": "Corey DiVietro",
            "company": "Farmers Insurance Agency, Illinois",
            "companyClass": ""
        },
        {
            "quote": "Our mailers through Only Insurance Leads are a vital part of our agency success. Every time that we increase our quantity of mailings our quote volume goes up - Only Insurance Leads is a no brainer!",
            "cite": "Khris Kennedy",
            "company": "Allstate Insurance Agency",
            "companyClass": ""
        },
        {
            "quote": "I've been using Only Insurance Leads (OIL) for over two years for homeowner's direct mailings.  In an era with DNC and Caller Id, telemarketing is less effective.  When my monthly mailings go out, I get 4-6 prospects calling the agency directly.",
            "cite": "Carlos Pereira",
            "company": "Allstate Insurance Agency",
            "companyClass": ""
        },
        {
            "quote": "I am fairly new to Direct Mail Leads and so far am very pleased with the process and the account representative. Shana has been very helpful with my many questions. We both have a goal toward success. I do recommend joining this company.",
            "cite": "Julia Gazzio",
            "company": "",
            "companyClass": ""
        },
        {
            "quote": "We have had great success since partnering with Only Insurance Leads. High quality mailer, great call-in rate, and easy to work with. Have many agents in my area asking what our secret is.",
            "cite": "Kasey Osman",
            "company": "",
            "companyClass": ""
        },
        {
            "quote": "My team has been using Only Insurance Leads for about 3 years. Within just a few months, we saw an immediate increase in call volume which resulted in more activity and sales. Shana has been phenomenal to work with and is very attentive to our needs. I recommend them to all of my agents!",
            "cite": "Tony Zinn",
            "company": "AN District Manager",
            "companyClass": ""
        },
        {
            "quote": "I signed up with Only Insurance Leads about 6 months ago as a trial and I have just doubled my monthly budget. I have been very satisfied with the results. It is twice as effective as the other mailing programs I have tried, and 10 times more effective than internet leads. Shana and Stephanie are the best!",
            "cite": "Jesse E. Horn",
            "company": "Farmers Insurance Agency, California",
            "companyClass": ""
        },
        {
            "quote": "Only insurance Leads has proven to drive in new business to my agency. We started off with 10k mailers a month probably getting around 20- 30 households calling in for quotes. We have found the close percentages on these mailers to be better than any other lead source. With the success we have gotten so far, we have doubled the amount of mailers going out. Customer service is always prompt as well. Happy with our decision in this company.",
            "cite": "Sam Kronshage",
            "company": "",
            "companyClass": ""
        },
        {
            "quote": "Shana is the go-to for organized easy mailers. She’s prompt in her response and very pleasant to work with.  I enjoy using their services very much and recommend you contact Shana for your mailing needs!",
            "cite": "Andrea Coulon",
            "company": "",
            "companyClass": ""
        },
        {
            "quote": "I have been with Only Insurance leads now for 2 years and I couldn't be happier.  I get a ton of activity in my office, and I am generating good business from my mailings. Highly recommend. Extremely satisfied.",
            "cite": "Darren Prozzo",
            "company": "",
            "companyClass": ""
        }
    ]
}